/*
【问题描述】请编写一个函数，实现如下公式计算：
输入整数n（1<=n<=10000），计算公式1+1/(1+2)+...+1/(1+2+...+n)的值。
要求在主函数中输入整数n，再调用该函数求得公式的值，最后在主函数中输出该值。
【输入形式】从控制台输入整数n（1<=n<=10000）。
【输出形式】控制台输出公式结果：小数点后保留4位。
【样例输入】4
【样例输出】1.6000
【样例说明】
输入n为4，求得公式1 + 1/(1+2) + 1/(1+2+3)+ 1/(1+2+3+4)的值为1.6000，小数点后保留4位。
注意：为保证数据的准确性和一致性，请使用double数据类型保存计算结果。
【测试数据及对应结果】1-1.0000，4-1.6000，51-1.9615，160-1.9876，10000-1.9998
*/
#include <bits/stdc++.h>
using namespace std;
#define endl '\n'
double calculate(int n){
    double sum1=0.0,sum2=0.0;
    for(int i=1;i<=n;i++){
        sum1+=i;
        sum2+=1/sum1;
    }
    return sum2;
}
int main(){
    int n=0;
    cin>>n;
    printf("%.4lf",calculate(n));
    return 0;
}